#include<stdio.h>
int he(int num);
int main()
{
    int num,i = 0;
    for(num = 100;num < 1000;num++)
    {
        if(he(num) == 15)
        {
            printf("%4d",num);
            i++;
            if(i % 5 == 0)printf("\n");
        }
    }
}

int he(int num)
{
    int sum = 0;
    if(num < 10)return num;
    else{
        sum += (num%10) + he(num/10);
    }
    return sum;
}
/*输出100到1000之间的各位数字之和能被15整除的所有数，输出时每5个一行，每个数输出占4列列宽。

输出格式:
在每行中输出5的满足要求的数值，每个数输出占4列列宽。

输出样例:
 159 168 177 186 195
 249 258 267 276 285
 294 339 348 357 366
 375 384 393 429 438
 447 456 465 474 483
 492 519 528 537 546
 555 564 573 582 591
 609 618 627 636 645
 654 663 672 681 690
 708 717 726 735 744
 753 762 771 780 807
 816 825 834 843 852
 861 870 906 915 924
 933 942 951 960*/
