#include<stdio.h>
int main()
{
    int i,j,k;
    printf("    ");
    for(i=1;i<10;i++)
    printf("%4d",i);
    printf("\n");
    for(j=1;j<10;j++)
    {
        printf("%4d",j);
        for(k=1;k<=j;k++)
        printf("%4d",j*k);
        printf("\n");
    }
    return 0;
}

/*输出形状为直角三角形的九九乘法表(每个元素占4个位置)

输入格式:
输出格式:
       1   2   3   4   5   6   7   8   9
   1   1
   2   2   4
   3   3   6   9
   4   4   8  12  16
   5   5  10  15  20  25
   6   6  12  18  24  30  36
   7   7  14  21  28  35  42  49
   8   8  16  24  32  40  48  56  64
   9   9  18  27  36  45  54  63  72  81



输入样例:
在这里给出一组输入。例如：





输出样例:
在这里给出相应的输出。例如：

       1   2   3   4   5   6   7   8   9
   1   1
   2   2   4
   3   3   6   9
   4   4   8  12  16
   5   5  10  15  20  25
   6   6  12  18  24  30  36
   7   7  14  21  28  35  42  49
   8   8  16  24  32  40  48  56  64
   9   9  18  27  36  45  54  63  72  81*/
