#include<stdio.h>
int main()
{
    int n,a,b,c,d,i = 0,j[80],k[80],l[80],m[80];
    scanf("%d",&n);
    for(d = 0;d <= 9;d++)
        for(c = 0;c <= 9;c++)
            for(b = 0;b <= 9;b++)
                for(a = 0;a <= 9;a++)
                    if(4 * a + 30 * b + 200 * c + 1000 * d == n && a != b && a != c && a != d && b != c && b != d && c != d)
                    {
                        j[i] = d;
                        k[i] = c;
                        l[i] = b;
                        m[i] = a;
                        i++;
                    }
    printf("%d\n",i);
    for(n = 0;n < i;n++)
        printf("%d%d%d%d\n",j[n],k[n],l[n],m[n]);
    return 0;
}
/*小博是新城小学二年级学生，这孩子人很老实，数学、语文成绩都是中等。不过一旦坐在电脑前，写起代码来，则有些霸气侧漏，尤其擅长各种暴力方法。本题就是数学莫老师的题目之一，请你和小博一起暴力求解吧。

1s.jpg

输入格式:
第一行给出这个和N（图中例子的和N为2000)。

输出格式:
第一行输出所有解的数目K，随后K行按照DCBA 4位数字从小到大输出所有解。

输入样例:
例如输入：

2000



输出样例:
则输出：

2
0965
1465*/
