#include<stdio.h>
int a[1000][1000];
int main()
{
    int i,j,n,s1 = 0,s2 = 0;
    while(scanf("%d",&n) != EOF)
    {
        for(i = 0;i < n;i++){
            for(j = 0;j < n;j++)
                scanf("%d",&a[i][j]);
        }
    for(i = 0,j = 0;i < n;i++,j++)
        s1 += a[i][j];
    for(i = 0,j = n - 1;i < n;i++,j--)
        s2 += a[i][j];
    printf("%d %d\n",s1,s2);
    s1 = 0,s2 = 0;}
    return 0;
}

/*输入一个n×n矩阵中各元素的值(整数)，求出两条对角线上的元素值之和。

输入格式:
多组输入，第一行输入n(n<=1000)。第二行开始的n行输入n×n的数组中的每一行的n个整数。

输出格式:
依次输出该n×n矩阵的主对角线和副对角线上元素值之和。两项之间一个空格。

输入样例:
3
24 5 89
13 59 15
85 3 27



输出样例:
110 233*/
